interThermalPhaseFoam/tutorials/wedge/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    Inlet
    {
        type            inletOutlet;
        nFaces          50;
        startFace       63520;
        faces           ( ( 2 3 7 6 ) );
    }
    BotOutlet1
    {
        type            inletOutlet;
        nFaces          50;
        startFace       63570;
        faces           ( ( 0 1 5 4 ) );
    }
    BotOutlet2
    {
        type            inletOutlet;
        nFaces          350;
        startFace       63620;
        faces           ( ( 1 9 13 5 ) ( 9 17 21 13 ) );
    }
    TopInlet
    {
        type            inletOutlet;
        nFaces          350;
        startFace       63970;
        faces           ( ( 10 2 6 14 ) ( 18 10 14 22 ) );
    }
    FreeStream
    {
        type            patch;
        nFaces          80;
        startFace       64320;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          64000;
        startFace       64400;
    }
    LeftSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       128400;
    }
)

// ************************************************************************* //
