interThermalPhaseFoam/tutorials/wedge/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
	type            fixedFluxPressure;
        value           uniform 0;

    }    

    BotOutlet1
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    BotOutlet2
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    TopInlet
    {
	type            fixedFluxPressure;
        value           uniform 0;

    }    

    FreeStream
    {
	type            fixedFluxPressure;
        value           uniform 0;
    }

    FrontNBack
    {
        type            empty;
    }

    LeftSide
    {
 	type            zeroGradient;
    }


}


// ************************************************************************* //
